In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [5]:
dframe1=DataFrame(np.arange(12).reshape(3,4),
                  index=['NY','LA','SF'],
                  columns=['A','B','C','D'])

dframe1

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [9]:
dframe1.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [46]:
dframe1.index=dframe1.index.map(str.lower)
dframe1

          ALPHA  B   C   D
new york      0  1   2   3
las           4  5   6   7
sf            8  9  10  11

In [47]:
dframe1.rename(index=str.title,columns=str.lower)

          alpha  b   c   d
New York      0  1   2   3
Las           4  5   6   7
Sf            8  9  10  11

In [48]:
dframe1.rename(index={'ny':'NEW YORK'},
              columns={'A':'ALPHA'})

dframe1

          ALPHA  B   C   D
new york      0  1   2   3
las           4  5   6   7
sf            8  9  10  11

In [49]:
dframe1

          ALPHA  B   C   D
new york      0  1   2   3
las           4  5   6   7
sf            8  9  10  11

In [50]:
dframe1.rename(index={'la':'Las'},inplace=True)

In [51]:
dframe1

          ALPHA  B   C   D
new york      0  1   2   3
las           4  5   6   7
sf            8  9  10  11